<template>
<v-container>
      <v-row
    v-touch="{
      left: () => swipe('Left'),
      right: () => swipe('Right'),
      up: () => swipe('Up'),
      down: () => swipe('Down')
    }">
  <v-card
    class="mx-auto my-12"
    max-width="374"
  >

  <v-carousel
  height="300"
  :show-arrows="false">
    <v-carousel-item
      v-for="(item,i) in items"
      :key="i"
      :src="item.src"
      
      reverse-transition="fade-transition"
      transition="fade-transition"
    ></v-carousel-item>
  </v-carousel>
  
  
    <v-card-title>シェルドン・クーパー　27歳</v-card-title>

    <v-card-text>
      <v-row
        align="center"
        class="mx-0"
      >
        <v-rating
          :value="4.5"
          color="pink"
          dense
          half-increments
          readonly
          size="14"
          full-icon="mdi-heart"
          half-icon="mdi-heart-half-full"
        ></v-rating>

        <div class="grey--text ml-4">4.5 (413)</div>
      </v-row>

      <div class="my-4 subtitle-1">
        自己紹介
      </div>

      <div>カリフォルニア工科大学の物理学博士。理論物理学者で、専門は当初はひも理論、後に暗黒物質に転向。IQは187。レナードのルームメイト。
テキサス東部で小学校に5年生までを過ごし、11歳で大学に飛び入学した。その後はドイツに留学し、ツイスター理論を研究していた16歳の時に博士号を取得。並み外れた頭脳の持ち主であり、幼少時は神童とされていた。直観像記憶が出来、記憶力も桁外れである。素数が赤く見えるなど、共感覚の持ち主でもある。
何事にも冷静かつ皮肉屋な性格で、常に論理的な思考に基づいて行動する。自分の頭脳に有り余る自信を持っており、学力の低い人間や世俗的な人間を見下す（レナードやハワードらもその例外ではない）傾向にある上、他人の感情にとことん疎いため、何かと人間関係をこじらせがちである。極めて優秀ではあるが子供っぽい一面も持ち、しばしば大人げない態度をとる。笑顔が苦手で、極端な潔癖性。お金に頓着がなく、友人への借金にも寛容。
ハワードに始めて出会った際、見た目がピューイーハーマンとC-3POに似ているからと「C3ピューイーハーマン」とからかわれた事をきっかけにお互いをけなし合う関係になった。
レナードと同様にオタク。「スター・ウォーズ・シリーズ」や「スタートレック」など、特にSF作品を好む。「バビロン5」は嫌いである。
劇中劇である教育科学番組の司会者プロトン教授ことアーサー・ジェフリーズ（ボブ・ニューハート）を尊敬しており、自身が科学の道へ進むきっかけとなった人物でもある。
旗章学にも大変精通しており、自身で制作したネット番組「旗で遊ぼう」の司会を勤めている。
契約書を制作する事が好きで、レナードとは「ルームメイト協定」を、エイミーとは「恋人協定」を結び、独自の倫理観で協定を遵守することに命をかけている。
自宅ソファの自分の位置（「僕の場所」）は「その席は冬はラジエーターにほど近く暖かく、なおかつ夏は発汗するほど近すぎない、夏は窓を開けるとちょうど風の通り道だ。テレビに対して正面じゃなく会話を邪魔しない。斜めに見て首を痛める角度でもない。まだまだある」
「グーチョキパー　トカゲ　スポックじゃんけん」は一般的なじゃんけんはパターンが限られているため、気の合う者同士でやると約8割は引き分けになることから考案された。
「ハサミは紙を切る、紙は石を包む、石はトカゲを潰す、トカゲがスポックに毒を吐く、スポックはハサミを破壊、ハサミはトカゲをちょん切り、トカゲは紙を食べ、紙はスポックに抗議、スポックは石を蒸発させる、石はハサミを壊す」じゃんけんの掛け声は「トカゲスポックじゃんけんぽん！」である。
好きなアミノ酸はリシンである。
兄と美人な双子の妹がいる。
バジンガ (Bazinga、Buzzinga) は、「ジョークだよ」「引っかかったな」といった意味であり、シーズン2の最終話からシーズン8の15話までに使われた。シェルドンの発言に笑い声を入れるタイミングが難しいことが多いため、脚本家が合図として考案した。
彼が育ったテキサスの素朴な田舎町は、科学者を目指す天才児にとってはあまり恵まれた環境とは言えなかったようで、日頃は故郷の町を疎ましがる発言をしている。が、いざとなると「僕はテキサスの男だ」「僕には体の隅から隅までテキサスの血が流れているんだ」などと、その勇猛ぶりをアピールしたがる節もある。
母のメアリーは非常に熱心なクリスチャン。神の存在を信じる人々を非科学的だと考えるシェルドンとは基本的に相容れない立場にあり、幼少期は何かにつけて宗教観を押しつけてくる母親に苦労していたという。その一方で彼は明らかにマザコンで、母親と会った際は何から何まで甘え、風邪で寝込んだ時などは子守唄までねだっている。
おじいちゃんおばあちゃんっ子でもあり、今でも彼らを「じいじ」「ばあば」と呼ぶ。祖父は5歳の時に亡くなったが、シェルドンが科学者になることを唯一応援してくれた家族であった。祖母もシェルドンを大変可愛がっており、彼を「ムーン・パイ」と呼んでいる。服の袖からティッシュを出すことからシェルドンは祖母を「スパイダーおばあちゃん」と表現している。
生活環境の変化を酷く嫌い、科学の概念であるホメオスタシスが自身の生活においても維持されることを強く望んでいる。シーズン7最終話では、大学から研究対象の変更を迫られたことや、お気に入りの場所であったスチュアートのコミックブックストアが火事で焼失したことから、パサデナを離れ、45日間の鉄道の旅に出た。
シーズン8の1話にて、パサデナに戻る。その際、旅は米国を横断する長大な路程であったが、道中では駅から離れることがなかったと語った。
シーズン8の最終話にて恋人のエイミーにプロポーズしようとするも、その前にエイミーに距離を置きたいと言われてしまい結局言えずに終わる。
その後シーズン9の1話で正式に破局するもお互いへの思いを再確認し復縁する。
復縁後最初のエイミーの誕生日に、大切に思っている事を伝えたいと、ついにエイミーとの性交渉を決意、童貞を捧げた。
シーズン10ではエイミーのアパートが水道管の破裂により水浸しになった事から実験と言いくるめられペニーの部屋で同棲を開始する。
シーズン10最終話ではかつて大学院生だったラモーナのアプローチを受けたことでついにエイミーへプロポーズをした。
本国アメリカでは、作中での振る舞いからシェルドンはアスペルガーを抱えた研究者なのかという指摘がある。それに対して制作側は、シェルドンは「シェルドニー」（Sheldony、シェルドン的なと言った意味）として描写しているのみであり、アスペルガーとラベリングしてほしくないと発言している。
ホーキング博士を尊敬しており、彼を「唯一自分と同等の知性を持った人間」と豪語している。
転職後はレナードの2倍の月給があるなど安定した収入を得ているものの仕事内容自体はあまり好きではないと度々話すシーンがあり再転職を考えているが、カードローンの返済の為と割り切って働いている。</div>
    </v-card-text>

    <v-divider class="mx-4"></v-divider>
    
  
  </v-card>
      </v-row>
  </v-container>





</template>

<script>
  export default {
    data () {
      return {
        items: [
          {
            src: 'https://rr.img.naver.jp/mig?src=http%3A%2F%2Fimgcc.naver.jp%2Fkaze%2Fmission%2FUSER%2F20160626%2F12%2F1277332%2F22%2F491x405xb42267cc25f890bfebe5dbd8.jpg%2F300%2F600&twidth=300&theight=600&qlt=80&res_format=jpg&op=',
          },
          {
            src: 'https://pbs.twimg.com/profile_images/1128570662740578304/fi-DGX_b_400x400.jpg',
          },
          {
            src: 'https://pbs.twimg.com/media/BX5MLL2CEAA2YT8.jpg',
          },
          {
            src: 'https://images-na.ssl-images-amazon.com/images/I/713%2BUNN755L._SY450_.jpg',
          },
        ],
      }
    },
    methods: {
      swipe (direction) {
		  if (direction == 'Left') {
			//   console.log(direction)
			  this.$router.push('/')
          }
          else if (direction == 'Right') {
			//   console.log(direction)
			  this.$router.push('/BBS/topic/つぶやき')
          }
        this.swipeDirection = direction
      },
    },
  }
</script>